slowpoke/boutique/home-logs/wrk2-all-1000-t4-conn16-r700-60s-1.log
[run.sh] Running home with 4 threads, 16 connections, and 60 seconds
[run.sh] Deleting all services
service "cart" deleted
deployment.apps "cart" deleted
service "checkout" deleted
deployment.apps "checkout" deleted
service "currency" deleted
deployment.apps "currency" deleted
service "email" deleted
deployment.apps "email" deleted
service "frontend" deleted
deployment.apps "frontend" deleted
service "payment" deleted
deployment.apps "payment" deleted
service "productcatalog" deleted
deployment.apps "productcatalog" deleted
service "recommendations" deleted
deployment.apps "recommendations" deleted
service "shipping" deleted
deployment.apps "shipping" deleted
[run.sh] Waiting for all pods to be deleted
ubuntu-client-6c977c85d8-t9fbh   1/1     Running   0          60m
[run.sh] Waiting for client to be ready
[run.sh] Client is ready
[run.sh] Deploying all services
service/cart created
deployment.apps/cart created
service/checkout created
deployment.apps/checkout created
service/currency created
deployment.apps/currency created
service/email created
deployment.apps/email created
service/frontend created
deployment.apps/frontend created
service/payment created
deployment.apps/payment created
service/productcatalog created
deployment.apps/productcatalog created
service/recommendations created
deployment.apps/recommendations created
service/shipping created
deployment.apps/shipping created
[run.sh] Waiting for all pods to be running
[run.sh] Waiting for all pods to be ready
cart-776c6f6f79-n9lrl checkout-744bff58d5-dsvs4 currency-77cf85dd45-x9lq7 email-5469cfc7d5-2t6fp frontend-5596756fb5-k7jth payment-85bbf9fb97-sznnt productcatalog-745b7cb86d-z9rqn recommendations-59b954559-jvlwd shipping-8665fcc4f9-5r6x8
[run.sh] All pods are ready
[run.sh] Checking heartbeat for all services
[run.sh] checkout is not reachable
[run.sh] email is not reachable
[run.sh] currency is not reachable
[run.sh] cart is not reachable
[run.sh] email is not reachable
[run.sh] email is not reachable
[run.sh] All services are ready
[run.sh] Running warmup test
Running 3s test @ http://frontend:80
  4 threads and 16 connections
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   76.16ms
 75.000%  121.54ms
 90.000%  161.92ms
 99.000%  224.13ms
 99.900%  256.38ms
 99.990%  264.45ms
 99.999%  264.45ms
100.000%  264.45ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       5.251     0.000000            1         1.00
       6.611     0.100000          199         1.11
      24.975     0.200000          398         1.25
      43.519     0.300000          597         1.43
      60.063     0.400000          796         1.67
      76.159     0.500000          996         2.00
      82.879     0.550000         1094         2.22
      91.647     0.600000         1194         2.50
     100.735     0.650000         1293         2.86
     110.655     0.700000         1392         3.33
     121.535     0.750000         1491         4.00
     126.719     0.775000         1541         4.44
     132.351     0.800000         1591         5.00
     139.135     0.825000         1643         5.71
     145.407     0.850000         1690         6.67
     153.599     0.875000         1740         8.00
     157.695     0.887500         1765         8.89
     162.303     0.900000         1790        10.00
     166.271     0.912500         1815        11.43
     172.543     0.925000         1839        13.33
     177.023     0.937500         1864        16.00
     181.375     0.943750         1877        17.78
     183.423     0.950000         1890        20.00
     188.031     0.956250         1902        22.86
     190.207     0.962500         1914        26.67
     198.527     0.968750         1927        32.00
     200.191     0.971875         1933        35.56
     203.007     0.975000         1940        40.00
     204.927     0.978125         1945        45.71
     207.103     0.981250         1951        53.33
     212.095     0.984375         1957        64.00
     217.471     0.985938         1961        71.11
     221.183     0.987500         1964        80.00
     222.207     0.989062         1967        91.43
     227.711     0.990625         1970       106.67
     232.959     0.992188         1973       128.00
     235.519     0.992969         1975       142.22
     238.463     0.993750         1976       160.00
     238.591     0.994531         1978       182.86
     239.103     0.995313         1979       213.33
     245.375     0.996094         1981       256.00
     246.655     0.996484         1982       284.44
     246.655     0.996875         1982       320.00
     247.167     0.997266         1983       365.71
     251.775     0.997656         1984       426.67
     255.615     0.998047         1985       512.00
     255.615     0.998242         1985       568.89
     255.615     0.998437         1985       640.00
     256.383     0.998633         1986       731.43
     256.383     0.998828         1986       853.33
     261.247     0.999023         1987      1024.00
     261.247     0.999121         1987      1137.78
     261.247     0.999219         1987      1280.00
     261.247     0.999316         1987      1462.86
     261.247     0.999414         1987      1706.67
     264.447     0.999512         1988      2048.00
     264.447     1.000000         1988          inf
#[Mean    =       81.912, StdDeviation   =       56.494]
#[Max     =      264.192, Total count    =         1988]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1992 requests in 3.05s, 7.22MB read
Requests/sec:    653.32
Transfer/sec:      2.37MB
[run.sh] /wrk2/wrk -t4 -c16 -d60s -L -s /wrk/scripts/online-boutique/home.lua http://frontend:80
[run.sh] Checking the resource usage
NAME                              CPU(cores)   MEMORY(bytes)   
cart-776c6f6f79-n9lrl             224m         8Mi             
checkout-744bff58d5-dsvs4         1m           3Mi             
currency-77cf85dd45-x9lq7         227m         9Mi             
email-5469cfc7d5-2t6fp            1m           3Mi             
frontend-5596756fb5-k7jth         308m         14Mi            
payment-85bbf9fb97-sznnt          1m           3Mi             
productcatalog-745b7cb86d-z9rqn   231m         10Mi            
recommendations-59b954559-jvlwd   1m           3Mi             
shipping-8665fcc4f9-5r6x8         1m           3Mi             
ubuntu-client-6c977c85d8-t9fbh    13m          1219Mi          
Running 1m test @ http://frontend:80
  4 threads and 16 connections
  Thread calibration: mean lat.: 287.591ms, rate sampling interval: 976ms
  Thread calibration: mean lat.: 266.930ms, rate sampling interval: 1069ms
  Thread calibration: mean lat.: 273.239ms, rate sampling interval: 1030ms
  Thread calibration: mean lat.: 263.318ms, rate sampling interval: 1093ms
    Req/Sec   165.88      5.58   180.00     77.37%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.81s 
 75.000%    2.47s 
 90.000%    2.88s 
 99.000%    3.57s 
 99.900%    4.13s 
 99.990%    4.20s 
 99.999%    4.23s 
100.000%    4.23s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     406.015     0.000000            1         1.00
     821.247     0.100000         3325         1.11
    1080.319     0.200000         6662         1.25
    1342.463     0.300000         9980         1.43
    1610.751     0.400000        13302         1.67
    1814.527     0.500000        16633         2.00
    1923.071     0.550000        18291         2.22
    2101.247     0.600000        19965         2.50
    2217.983     0.650000        21617         2.86
    2344.959     0.700000        23289         3.33
    2473.983     0.750000        24929         4.00
    2541.567     0.775000        25781         4.44
    2596.863     0.800000        26614         5.00
    2658.303     0.825000        27425         5.71
    2723.839     0.850000        28261         6.67
    2799.615     0.875000        29090         8.00
    2838.527     0.887500        29506         8.89
    2877.439     0.900000        29921        10.00
    2924.543     0.912500        30338        11.43
    2983.935     0.925000        30746        13.33
    3041.279     0.937500        31160        16.00
    3067.903     0.943750        31379        17.78
    3090.431     0.950000        31578        20.00
    3121.151     0.956250        31790        22.86
    3166.207     0.962500        31991        26.67
    3211.263     0.968750        32205        32.00
    3233.791     0.971875        32312        35.56
    3260.415     0.975000        32414        40.00
    3305.471     0.978125        32513        45.71
    3338.239     0.981250        32619        53.33
    3383.295     0.984375        32719        64.00
    3438.591     0.985938        32770        71.11
    3504.127     0.987500        32823        80.00
    3540.991     0.989062        32876        91.43
    3596.287     0.990625        32928       106.67
    3659.775     0.992188        32978       128.00
    3753.983     0.992969        33004       142.22
    3817.471     0.993750        33030       160.00
    3862.527     0.994531        33057       182.86
    3901.439     0.995313        33083       213.33
    3952.639     0.996094        33110       256.00
    3971.071     0.996484        33121       284.44
    3989.503     0.996875        33134       320.00
    4012.031     0.997266        33147       365.71
    4046.847     0.997656        33160       426.67
    4087.807     0.998047        33173       512.00
    4098.047     0.998242        33179       568.89
    4108.287     0.998437        33186       640.00
    4120.575     0.998633        33193       731.43
    4126.719     0.998828        33199       853.33
    4132.863     0.999023        33205      1024.00
    4139.007     0.999121        33208      1137.78
    4143.103     0.999219        33212      1280.00
    4151.295     0.999316        33216      1462.86
    4155.391     0.999414        33218      1706.67
    4165.631     0.999512        33221      2048.00
    4169.727     0.999561        33224      2275.56
    4173.823     0.999609        33225      2560.00
    4175.871     0.999658        33226      2925.71
    4177.919     0.999707        33228      3413.33
    4182.015     0.999756        33229      4096.00
    4184.063     0.999780        33230      4551.11
    4186.111     0.999805        33231      5120.00
    4190.207     0.999829        33232      5851.43
    4198.399     0.999854        33233      6826.67
    4198.399     0.999878        33233      8192.00
    4202.495     0.999890        33234      9102.22
    4202.495     0.999902        33234     10240.00
    4214.783     0.999915        33235     11702.86
    4214.783     0.999927        33235     13653.33
    4214.783     0.999939        33235     16384.00
    4222.975     0.999945        33236     18204.44
    4222.975     0.999951        33236     20480.00
    4222.975     0.999957        33236     23405.71
    4222.975     0.999963        33236     27306.67
    4222.975     0.999969        33236     32768.00
    4231.167     0.999973        33237     36408.89
    4231.167     1.000000        33237          inf
#[Mean    =     1854.871, StdDeviation   =      774.158]
#[Max     =     4227.072, Total count    =        33237]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  39853 requests in 1.00m, 144.35MB read
Requests/sec:    663.96
Transfer/sec:      2.40MB